-- Patch 模组：翻译 Lingering Voices 的所有台词
-- 此文件必须在原模组之后加载

-- 扑击时的台词
lungeList = {
	"躲起来...",
	"跑...",
	"救救我们...",
	"救救我...",
    "...你",
    "你！...",
    "...阻止我！",
    "...阻止我们！",
    "...不",
    "不...！",
    "哈哈哈...",
    "哈哈哈哈...",
    "哈哈...哈...",
}
lungeLines = { zombieLine:new("%s", lungeList) }

-- 被击中/踉跄时的台词
staggerList = {
    "哈哈哈...",
    "哈哈哈哈...",
    "哈哈...哈...",
    "...不",
    "...不！",
    "...不-不",
	"...不-不！",
    "不...！",
    "不-不...！",
	"...天哪",
    "天哪...",
    "跑...",
    "跑！...",
    "我不行...",
    "...等等！",
    "...等等",
    "...等-等",
    "等等！...",
    "等-等！...",
    "...求求你！",
    "...求求你",
	"...求-求你",
    "求求你！...",
    "求-求你！...",
    "...别！",
    "...别",
    "...别-别",
    "别！...",
    "别-别！...",
    "...你",
    "你！...",
    "...停下",
    "停下！...",
}
staggerLines = { zombieLine:new("%s", staggerList) }

-- 假死时的台词
fakeDeadList = {
	"...不",
    "...跑",
    "...等等",
    "...求求你",
    "哈哈...哈...",
    "哈哈哈...",
    "哈哈哈哈...",
    "...你",
}
fakeDeadLines = { zombieLine:new("%s", fakeDeadList) }

-- 敲门/敲击时的台词
thumpingList = {
	"喂...？",
	"...求求你",
    "...开门！",
    "开门！...",
    "...你",
    "哈哈...哈...",
    "哈哈哈...",
    "把它打开！...",
    "...打开它！",
    "有人吗...？",
}
thumpingLines = { zombieLine:new("%s", thumpingList) }

-- 攻击时的台词
attackList = {
	"对不起...",
	"...我...不行",
	"...求求你别...",
	"...停-停下我",
    "...停下我！",
	"...停下我们",
	"...不...不",
	"...别再这样了",
    "...救命",
    "救救我们...",
	"救救我...",
    "跑...",
    "...有人吗！",
    "...任何人！",
    "离远点...",
    "保持清醒...",
    "你！...",
    "...你",
    "...等等",
    "...等-等",
}
attackLines = { zombieLine:new("%s", attackList) }